# Напишите программу, в которой пользователь будет задавать две строки, а программа -
# определять количество вхождений одной строки в другой.

st1 = input('Введите первую строку ')
st2 = input('Введите вторую строку ')
print(st1.count(st2))
